In [3]:
import pandas as pd
data = pd.read_csv("nba.csv")
print("NBA Dataset (First 5 Rows):")
print(data.head())

NBA Dataset (First 5 Rows):
            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [6]:
import pandas as pd
data = pd.read_csv("nba.csv")
salary = data['Salary']
print("First 5 salaries")
print(salary.head())

First 5 salaries
0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

In [7]:
import pandas as pd
data = pd.read_csv("nba.csv")
salary_name = data[['Name','Salary']].head()
print("First 5 Rows of Name and Salary Columns:")
print(salary_name)

First 5 Rows of Name and Salary Columns:
            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jonas Jerebko  5000000.0

In [8]:
import pandas as pd
data = pd.read_csv("nba.csv")
sorted_data = data.sort_values(by = 'Age',ascending = True)
top_sorted = sorted_data.head()
print("First 5 rows after sorting by age:")
print(top_sorted)

First 5 rows after sorting by age:
                   Name                Team  Number Position   Age Height  \
122        Devin Booker        Phoenix Suns     1.0       SG  19.0    6-6
226       Rashad Vaughn     Milwaukee Bucks    20.0       SG  19.0    6-6
60       Christian Wood  Philadelphia 76ers    35.0       PF  20.0   6-11
40   Kristaps Porzingis     New York Knicks     6.0       PF  20.0    7-3
62        Bruno Caboclo     Toronto Raptors    20.0       SF  20.0    6-9

     Weight   College     Salary
122   206.0  Kentucky  2127840.0
226   202.0      UNLV  1733040.0
60    220.0      UNLV   525093.0
40    240.0       NaN  4131720.0
62    205.0       NaN  1524000.0

In [2]:
# Selecting single col
import pandas as pd
data = pd.read_csv("nba.csv",index_col = "Name")
print("Dataset")
display(data.head(5))

first = data["Age"]
print("\nSingle Column selected from Dataset")
display(first.head(5))

Dataset

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Single Column selected from Dataset

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
Name: Age, dtype: float64

In [3]:
#Selecting a single row

import pandas as pd
data = pd.read_csv("nba.csv",index_col="Name")
row = data.loc["Avery Bradley"]
print(row)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [4]:
# Selecting by pos
import pandas as pd
data = pd.read_csv("nba.csv",index_col = "Name")
row = data.iloc[3]
print(row)

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [5]:

#Slicing

import pandas as pd
player_list=[['Dhoni',36,75,5454333],['ABC',38,74,374757],['Vkholi',31,79,444444]]
df = pd.DataFrame(player_list,columns=['Name','Age','Weight','Salary'])
print(df)

     Name  Age  Weight   Salary
0   Dhoni   36      75  5454333
1     ABC   38      74   374757
2  Vkholi   31      79   444444

In [7]:
# specific cell

import pandas as pd
player_list=[['Dhoni',36,75,5454333],['ABC',38,74,374757],['Vkholi',31,79,444444]]
#value = df.loc['Vkholi,'Salary']
#print("\nValue of the specific cell(Vkholi,Salary):",value)
df = pd.DataFrame(player_list,columns=['Name','Age','Weight','Salary'])
print(df)

     Name  Age  Weight   Salary
0   Dhoni   36      75  5454333
1     ABC   38      74   374757
2  Vkholi   31      79   444444

In [8]:
#Filterinng

import pandas as pd
dataFrame = pd.DataFrame({'Name':[' Rachel ',' Monica ',' Priya '],
                          'Age':[30, 35, 40],
                          'Salary':[100000, 93000, 90000],
                          'Job':['Designer','Chef','IT']})
display(dataFrame)

       Name  Age  Salary       Job
0   Rachel    30  100000  Designer
1   Monica    35   93000      Chef
2    Priya    40   90000        IT

In [9]:
# Multiple cond 
#display(dataFrame.loc[(dataFrame['Salary']>=100000)&(dataFrame['Age']<40)&(dataFrame['Job'].str.startwith('D')),['Name','Job']])